---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricParamMajorLapspliceLength
source: html/5ee4a514-be00-54d1-ac57-9b65d3d26a42.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricParamMajorLapspliceLength Property

"Major Lap Splice Length": Fabric lap splice length in major direction in the fabric distribution.

## Syntax (C#)
```csharp
public static ForgeTypeId FabricParamMajorLapspliceLength { get; }
```